Repository: terryhyuk/piggy_log
Catalog: lib/l10n/app_*.arb
Languages: th

source: Cancel
th: ยกเลิก

source: Save
th: บันทึก

source: Edit
th: แก้ไข

source: Delete
th: ลบ

source: Update
th: อัปเดต

source: was removed
th: ถูกลบออกแล้ว

source: Confirm Delete
th: ยืนยันการลบ

source: Deleted
th: ลบแล้ว

# deleteConfirm
source: delete?
th: ต้องการลบหรือไม่?

source: Category Name
th: ชื่อหมวดหมู่

source: Color
th: สี

source: Category Created
th: สร้างหมวดหมู่แล้ว

source: New category added
th: เพิ่มหมวดหมู่ใหม่แล้ว

source: Category Updated
th: อัปเดตหมวดหมู่แล้ว

source: Changes saved
th: บันทึกการเปลี่ยนแปลงแล้ว

source: No transactions found
th: ไม่พบรายการธุรกรรม

source: Total Expense
th: ค่าใช้จ่ายรวม

source: Set Your Budget
th: ตั้งงบประมาณของคุณ

source: No Transactions
th: ไม่พบรายการใช้จ่าย

# recentTranscations
source: Recent Transactions
th: ธุรกรรมล่าสุด

source: Set Monthly Budget
th: ตั้งงบประมาณรายเดือน

source: Enter Your Budget
th: กรอกงบประมาณของคุณ

source: Categories
th: หมวดหมู่

source: Add Category
th: เพิ่มหมวดหมู่

source: Edit Category
th: แก้ไขหมวดหมู่

source: Add
th: เพิ่ม

source: Delete Category
th: ลบหมวดหมู่

source: Title
th: หัวข้อ

source: Amount
th: จำนวนเงิน

source: Memo
th: บันทึกช่วยจำ

source: Recurring
th: รายการที่เกิดซ้ำ

source: Expense
th: รายจ่าย

source: Income
th: รายรับ

source: Select Date
th: เลือกวันที่

source: Delete Transaction
th: ลบธุรกรรม

# deleteTransactionConfirm
source: Are you sure you want to delete this transaction?
th: คุณแน่ใจหรือไม่ว่าต้องการลบธุรกรรมนี้?

source: Add Transaction
th: เพิ่มธุรกรรม

source: Edit Transaction
th: แก้ไขธุรกรรม

source: Settings
th: การตั้งค่า

source: Language
th: ภาษา

source: Theme
th: ธีม

source: Currency
th: สกุลเงิน

source: Date Format
th: รูปแบบวันที่

source: Enter valid amount
th: กรุณากรอกจำนวนเงินที่ถูกต้อง

source: Please enter title
th: กรุณากรอกหัวข้อ

source: Recurring Transaction
th: ธุรกรรมที่เกิดซ้ำ

source: Search Icons
th: ค้นหาไอคอน

source: Confirm Delete Transaction
th: ยืนยันการลบธุรกรรม

source: Transaction Updated
th: อัปเดตธุรกรรมแล้ว

source: Transaction Created
th: สร้างธุรกรรมแล้ว

source: Select Category
th: เลือกหมวดหมู่

source: Select Icon
th: เลือกไอคอน

source: Select Color
th: เลือกสี

source: Transaction
th: ธุรกรรม

source: Total Expense
th: ค่าใช้จ่ายรวม

source: Recent Transactions
th: ธุรกรรมล่าสุด

source: Enter Monthly Budget
th: กรอกงบประมาณรายเดือน

source: Date Format
th: รูปแบบวันที่

# errorTransactionDetail
source: Failed to open transaction detail.
th: ไม่สามารถเปิดรายละเอียดธุรกรรมได้

# pleaseEnterCategoryName
source: Please enter a category name
th: กรุณากรอกชื่อหมวดหมู่

source: Monthly Budget History
th: ประวัติงบประมาณรายเดือน

source: Remaining
th: คงเหลือ

source: Over Budget
th: เกินงบประมาณ

source: Budget
th: งบประมาณ

source: Data Management
th: การจัดการข้อมูล

source: Export Backup
th: ส่งออกข้อมูลสำรอง

source: Import Backup
th: นำเข้าข้อมูลสำรอง

# exportDesc
source: Save your data to your device or cloud.
th: บันทึกข้อมูลของคุณไปยังอุปกรณ์หรือคลาวด์

# importDesc
source: Restore data from a backup file.
th: กู้คืนข้อมูลจากไฟล์สำรอง

source: Warning
th: คำเตือน

# restoreWarning
source: Importing will delete all current data and replace it with the file's data. Do you want to proceed?
th: กู้คืนคำเตือน?

source: Confirm
th: ยืนยัน

source: Export Success
th: บันทึกไฟล์สำรองข้อมูลสำเร็จแล้ว

source: Restore Success
th: กู้คืนข้อมูลสำเร็จแล้ว

source: Category Name Already Exists
th: หมวดหมู่ชื่อมีอยู่แล้ว

# checkTitleAndAmount
source: Please check the description and amount.
th: กรุณาตรวจสอบรายละเอียดและจำนวนเงิน

source: description
th: รายละเอียด

source: View Analysis
th: ดูการวิเคราะห์

source: Spending Analysis
th: การวิเคราะห์การใช้จ่าย

source: Category Balance
th: สมดุลหมวดหมู่

source: Weekly Spending Trend
th: แนวโน้มการใช้จ่ายรายสัปดาห์

# analysisStep1
source: Analysis Complete! 5+ records found! 🐷
th: วิเคราะห์เสร็จแล้ว! มีข้อมูลมากกว่า 5 รายการแล้วนะ อู๊ดๆ! 🐷

# analysisStep2
source: Check the Radar Chart above for your balance,
th: ดูแผนภูมิเรดาร์ด้านบนเพื่อเช็กสมดุลการใช้จ่าย,

# analysisStep3
source: and the Bar Chart below for your weekly peak spending!
th: และดูแผนภูมิแท่งด้านล่างว่าวันไหนใช้จ่ายเยอะที่สุดนะครับ!

# weeklyTrend
source: Weekly Spending Trend
th: แนวโน้มรายสัปดาห์

# pleaseEnterDescription
source: Please enter a description
th: กรุณากรอกรายละเอียด

# pleaseEnterAmount
source: Please enter an amount
th: กรุณากรอกจำนวนเงิน

# invalidAmount
source: Please enter a valid number
th: กรุณากรอกตัวเลขที่ถูกต้อง

# categoryNameRequired
source: Category name is required
th: กรุณากรอกชื่อหมวดหมู่

# budgetUpdated
source: Budget updated successfully
th: อัปเดตงบประมาณเรียบร้อยแล้ว

source: Done
th: เสร็จสิ้น (Set-sin)

# monthlyBudgetTitle
source: {month} Budget
th: งบประมาณเดือน{month}

# totalExpenseTitle
source: {month} Total Expense
th: รายจ่ายทั้งหมดเดือน{month}

# historyMonthTitle
source: {month} {year}
th: เดือน{month} {year}

# onboarding_cat_msg
source: Create categories and tap to log! Long press to edit or delete them! 🐷
th: สร้างหมวดหมู่แล้วแตะเพื่อบันทึก! กดค้างไว้เพื่อแก้ไขหรือลบได้เลย! 🐷

# onboarding_chart_msg
source: Check your spending ratio at a glance with the pie chart! 📊
th: ตรวจสอบสัดส่วนการใช้จ่าย ได้อย่างรวดเร็วด้วยแผนภูมิวงกลม! 📊

# onboarding_setting_msg
source: Safely backup and restore your data right here! 💾
th: สำรองและเรียกคืนข้อมูล ของคุณได้อย่างปลอดภัยที่นี่! 💾

# ratingTitle
source: Knock knock...? is Piggy Log useful?
th: ก๊อกๆ...? Piggy Log ใช้ดีไหมครับ?

# ratingSubTitle
source: If you like it, could you give me 5 stars? (Fingers crossed!)
th: ถ้าถูกใจ ช่วยให้ 5 ดาวหน่อยนะครับ... (ตื่นเต้นจัง)

# ratingConfirm
source: Sure! I'd love to!
th: ได้เลย! จัดให้เดี๋ยวนี้

# ratingCancel
source: Maybe later...
th: ไว้วันหลังนะ...
